Tekla Open API Reference for Tekla Structures 2025
PointCloud.GetVisibleInViews Method
 Gets the views in which this point cloud is visible.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<View> GetVisibleInViews()
Public Function GetVisibleInViews As List(Of View)
Return Value
Type: List<View>
The available point clouds.
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace